AWS_RedisCluster/6_redis/2Stress_hdd4.txt
====== PING_INLINE ======
  100000 requests completed in 3.36 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

0.00% <= 1 milliseconds
91.34% <= 2 milliseconds
98.72% <= 3 milliseconds
99.04% <= 4 milliseconds
99.44% <= 5 milliseconds
99.74% <= 6 milliseconds
99.79% <= 7 milliseconds
99.80% <= 9 milliseconds
99.83% <= 10 milliseconds
99.91% <= 11 milliseconds
99.95% <= 12 milliseconds
99.95% <= 13 milliseconds
99.97% <= 14 milliseconds
99.99% <= 15 milliseconds
100.00% <= 15 milliseconds
29726.52 requests per second

====== PING_BULK ======
  100000 requests completed in 3.38 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

0.00% <= 1 milliseconds
91.51% <= 2 milliseconds
99.11% <= 3 milliseconds
99.31% <= 4 milliseconds
99.50% <= 5 milliseconds
99.77% <= 6 milliseconds
99.84% <= 7 milliseconds
99.86% <= 8 milliseconds
99.91% <= 9 milliseconds
99.98% <= 10 milliseconds
100.00% <= 10 milliseconds
29577.05 requests per second

====== SET ======
  100000 requests completed in 3.22 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

0.00% <= 1 milliseconds
95.21% <= 2 milliseconds
99.83% <= 3 milliseconds
99.96% <= 4 milliseconds
99.97% <= 5 milliseconds
99.99% <= 6 milliseconds
100.00% <= 6 milliseconds
31055.90 requests per second

====== GET ======
  100000 requests completed in 3.30 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

0.00% <= 1 milliseconds
95.07% <= 2 milliseconds
99.68% <= 3 milliseconds
99.90% <= 4 milliseconds
99.95% <= 6 milliseconds
99.96% <= 7 milliseconds
99.99% <= 8 milliseconds
100.00% <= 8 milliseconds
30349.01 requests per second

====== INCR ======
  100000 requests completed in 3.38 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

0.00% <= 1 milliseconds
93.31% <= 2 milliseconds
99.93% <= 3 milliseconds
100.00% <= 4 milliseconds
100.00% <= 204 milliseconds
29568.30 requests per second

====== LPUSH ======
  100000 requests completed in 3.35 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

0.00% <= 1 milliseconds
94.00% <= 2 milliseconds
99.69% <= 3 milliseconds
99.79% <= 4 milliseconds
99.82% <= 5 milliseconds
99.86% <= 6 milliseconds
99.90% <= 7 milliseconds
99.90% <= 10 milliseconds
99.93% <= 11 milliseconds
99.99% <= 12 milliseconds
100.00% <= 203 milliseconds
100.00% <= 205 milliseconds
29850.75 requests per second

====== RPUSH ======
  100000 requests completed in 3.39 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

0.00% <= 1 milliseconds
91.90% <= 2 milliseconds
98.01% <= 3 milliseconds
98.80% <= 4 milliseconds
99.68% <= 5 milliseconds
99.93% <= 6 milliseconds
99.95% <= 8 milliseconds
99.95% <= 9 milliseconds
100.00% <= 203 milliseconds
29507.23 requests per second

====== LPOP ======
  100000 requests completed in 3.45 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

0.00% <= 1 milliseconds
90.02% <= 2 milliseconds
98.79% <= 3 milliseconds
99.59% <= 4 milliseconds
99.88% <= 5 milliseconds
99.95% <= 10 milliseconds
99.96% <= 11 milliseconds
100.00% <= 12 milliseconds
28951.94 requests per second

====== RPOP ======
  100000 requests completed in 3.38 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

0.00% <= 1 milliseconds
92.38% <= 2 milliseconds
99.47% <= 3 milliseconds
99.71% <= 4 milliseconds
99.79% <= 5 milliseconds
99.81% <= 9 milliseconds
99.82% <= 10 milliseconds
99.88% <= 11 milliseconds
99.88% <= 12 milliseconds
99.91% <= 13 milliseconds
99.96% <= 14 milliseconds
100.00% <= 15 milliseconds
100.00% <= 15 milliseconds
29550.83 requests per second

====== SADD ======
  100000 requests completed in 3.92 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

0.00% <= 1 milliseconds
68.25% <= 2 milliseconds
98.33% <= 3 milliseconds
99.42% <= 4 milliseconds
99.58% <= 5 milliseconds
99.73% <= 6 milliseconds
99.82% <= 7 milliseconds
99.88% <= 8 milliseconds
99.93% <= 9 milliseconds
99.93% <= 10 milliseconds
99.95% <= 11 milliseconds
99.97% <= 12 milliseconds
99.99% <= 13 milliseconds
100.00% <= 201 milliseconds
25523.23 requests per second

====== HSET ======
  100000 requests completed in 3.61 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

0.00% <= 1 milliseconds
85.45% <= 2 milliseconds
99.65% <= 3 milliseconds
99.95% <= 4 milliseconds
99.96% <= 5 milliseconds
100.00% <= 6 milliseconds
100.00% <= 202 milliseconds
100.00% <= 203 milliseconds
27693.16 requests per second

====== SPOP ======
  100000 requests completed in 3.70 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

0.00% <= 1 milliseconds
81.47% <= 2 milliseconds
99.44% <= 3 milliseconds
99.75% <= 4 milliseconds
99.79% <= 5 milliseconds
99.91% <= 6 milliseconds
99.98% <= 7 milliseconds
100.00% <= 8 milliseconds
100.00% <= 8 milliseconds
27027.03 requests per second

====== LPUSH (needed to benchmark LRANGE) ======
  100000 requests completed in 3.75 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

0.00% <= 1 milliseconds
80.67% <= 2 milliseconds
98.30% <= 3 milliseconds
99.84% <= 4 milliseconds
99.90% <= 10 milliseconds
99.93% <= 11 milliseconds
99.96% <= 12 milliseconds
99.98% <= 13 milliseconds
99.99% <= 14 milliseconds
100.00% <= 14 milliseconds
26645.35 requests per second

====== LRANGE_100 (first 100 elements) ======
  100000 requests completed in 3.68 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

0.00% <= 1 milliseconds
83.65% <= 2 milliseconds
98.94% <= 3 milliseconds
99.80% <= 4 milliseconds
99.89% <= 5 milliseconds
99.93% <= 6 milliseconds
99.97% <= 7 milliseconds
99.99% <= 8 milliseconds
100.00% <= 8 milliseconds
27173.91 requests per second

====== LRANGE_300 (first 300 elements) ======
  100000 requests completed in 3.57 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

0.00% <= 1 milliseconds
85.87% <= 2 milliseconds
99.64% <= 3 milliseconds
99.89% <= 4 milliseconds
99.96% <= 5 milliseconds
99.97% <= 6 milliseconds
99.99% <= 7 milliseconds
100.00% <= 205 milliseconds
27979.86 requests per second

====== LRANGE_500 (first 450 elements) ======
  100000 requests completed in 3.72 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

0.00% <= 1 milliseconds
79.76% <= 2 milliseconds
99.51% <= 3 milliseconds
99.77% <= 4 milliseconds
99.82% <= 5 milliseconds
99.83% <= 6 milliseconds
99.85% <= 9 milliseconds
99.90% <= 10 milliseconds
99.93% <= 11 milliseconds
99.98% <= 12 milliseconds
100.00% <= 205 milliseconds
26852.85 requests per second

====== LRANGE_600 (first 600 elements) ======
  100000 requests completed in 3.73 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

0.00% <= 1 milliseconds
81.61% <= 2 milliseconds
98.64% <= 3 milliseconds
99.20% <= 4 milliseconds
99.53% <= 5 milliseconds
99.79% <= 6 milliseconds
99.91% <= 7 milliseconds
99.96% <= 8 milliseconds
99.97% <= 9 milliseconds
99.99% <= 10 milliseconds
100.00% <= 10 milliseconds
26838.43 requests per second

====== MSET (10 keys) ======
  100000 requests completed in 3.90 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

0.00% <= 1 milliseconds
70.22% <= 2 milliseconds
99.26% <= 3 milliseconds
99.54% <= 4 milliseconds
99.76% <= 5 milliseconds
99.89% <= 6 milliseconds
99.96% <= 7 milliseconds
99.98% <= 8 milliseconds
100.00% <= 9 milliseconds
100.00% <= 203 milliseconds
25634.45 requests per second